# CoordinateSystem Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IConnector..::..CoordinateSystem Property
IConnector Interface See Also
---
The coordinate system of the connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
Transform CoordinateSystem { get; }
```

Visual Basic
---
```text
ReadOnly Property CoordinateSystem As Transform
	Get
```

Visual C++
---
```text
property Transform^ CoordinateSystem {
	Transform^ get ();
}
```

# Remarks
The Z axis of the coordinate system is the normal to the plane of the connector.
# See Also
IConnector Interface
Autodesk.Revit.DB Namespace